<?php

return [
    'hello' => 'สวัสดี!',
    'whoops' => 'อุ๊ปส์!',
    'regards' => 'ด้วยความเคารพ,',
    'subcopy' => "หากคุณมีปัญหาในการคลิกปุ่ม \":actionText\" ให้คัดลอกและวาง URL ด้านล่างนี้\nลงในเว็บเบราว์เซอร์ของคุณ:",
    'password_reset' => [
        'subject' => 'แจ้งเตือนการรีเซ็ตรหัสผ่าน',
        'intro' => 'คุณได้รับอีเมล์นี้เนื่องจากเราได้รับคำขอรีเซ็ตรหัสผ่านสำหรับบัญชีของคุณ',
        'action' => 'รีเซ็ตรหัสผ่าน',
        'expire' => 'ลิงก์รีเซ็ตรหัสผ่านนี้จะหมดอายุใน 60 นาที',
        'no_action' => 'หากคุณไม่ได้ขอรีเซ็ตรหัสผ่าน ไม่จำเป็นต้องดำเนินการใดๆ เพิ่มเติม',
    ],
]; 