<?php

use Illuminate\Support\Facades\Facade;
use Illuminate\Support\ServiceProvider;

return [

    /*
    |--------------------------------------------------------------------------
    | ชื่อแอปพลิเคชัน
    |--------------------------------------------------------------------------
    |
    | ค่านี้คือชื่อของแอปพลิเคชันของคุณ ค่านี้จะถูกใช้เมื่อเฟรมเวิร์คต้องการ
    | แสดงชื่อแอปพลิเคชันในการแจ้งเตือนหรือในตำแหน่งอื่นๆ ตามที่แอปพลิเคชัน
    | หรือแพ็คเกจของแอปพลิเคชันต้องการ
    |
    */

    'name' => env('APP_NAME', 'Laravel'),

    /*
    |--------------------------------------------------------------------------
    | สภาพแวดล้อมของแอปพลิเคชัน
    |--------------------------------------------------------------------------
    |
    | ค่านี้กำหนด "สภาพแวดล้อม" ที่แอปพลิเคชันของคุณกำลังทำงานอยู่
    | ซึ่งอาจกำหนดวิธีที่คุณต้องการกำหนดค่าบริการต่างๆ ที่แอปพลิเคชันใช้
    | ตั้งค่านี้ในไฟล์ ".env" ของคุณ
    |
    */

    'env' => env('APP_ENV', 'production'),

    /*
    |--------------------------------------------------------------------------
    | โหมดดีบักของแอปพลิเคชัน
    |--------------------------------------------------------------------------
    |
    | เมื่อแอปพลิเคชันของคุณอยู่ในโหมดดีบัก ข้อความข้อผิดพลาดโดยละเอียดพร้อม
    | กับ stack trace จะแสดงในทุกข้อผิดพลาดที่เกิดขึ้นภายในแอปพลิเคชันของคุณ
    | หากปิดใช้งาน จะแสดงเพียงหน้าข้อผิดพลาดทั่วไปอย่างง่าย
    |
    */

    'debug' => (bool) env('APP_DEBUG', false),

    /*
    |--------------------------------------------------------------------------
    | URL ของแอปพลิเคชัน
    |--------------------------------------------------------------------------
    |
    | URL นี้ถูกใช้โดยคอนโซลเพื่อสร้าง URL อย่างถูกต้องเมื่อใช้เครื่องมือ
    | คำสั่ง Artisan คุณควรตั้งค่านี้เป็น root ของแอปพลิเคชันของคุณ
    | เพื่อใช้เมื่อรันคำสั่ง Artisan
    |
    */

    'url' => env('APP_URL', 'http://localhost'),

    'asset_url' => env('ASSET_URL', 'http://localhost'),

    /*
    |--------------------------------------------------------------------------
    | โซนเวลาของแอปพลิเคชัน
    |--------------------------------------------------------------------------
    |
    | ที่นี่คุณสามารถระบุโซนเวลาเริ่มต้นสำหรับแอปพลิเคชันของคุณ ซึ่งจะถูกใช้
    | โดยฟังก์ชัน date และ date-time ของ PHP เราได้ตั้งค่านี้เป็นค่าเริ่มต้น
    | ที่เหมาะสมสำหรับคุณไว้แล้ว
    |
    */

    'timezone' => 'Asia/Bangkok',

    /*
    |--------------------------------------------------------------------------
    | การกำหนดค่าภาษาของแอปพลิเคชัน
    |--------------------------------------------------------------------------
    |
    | ภาษาของแอปพลิเคชันกำหนดภาษาเริ่มต้นที่จะถูกใช้โดยตัวให้บริการการแปล
    | คุณสามารถตั้งค่านี้เป็นภาษาใดก็ได้ที่จะได้รับการสนับสนุนโดยแอปพลิเคชัน
    | การตั้งค่านี้ทำให้ Laravel ใช้ภาษาที่กำหนดเป็นค่าเริ่มต้นอัตโนมัติ
    |
    */

    'locale' => 'th',

    /*
    |--------------------------------------------------------------------------
    | ภาษาสำรองของแอปพลิเคชัน
    |--------------------------------------------------------------------------
    |
    | ภาษาสำรองกำหนดภาษาที่จะใช้เมื่อภาษาปัจจุบันไม่พร้อมใช้งาน
    | คุณสามารถเปลี่ยนค่านี้ให้ตรงกับโฟลเดอร์ภาษาใดก็ได้ที่มีอยู่ในแอปพลิเคชัน
    | ถ้าไม่พบข้อความแปลในภาษาหลัก (locale) Laravel จะใช้ข้อความจากภาษาสำรองนี้แทน
    |
    */

    'fallback_locale' => 'en',

    /*
    |--------------------------------------------------------------------------
    | ภาษาสำหรับ Faker
    |--------------------------------------------------------------------------
    |
    | ภาษานี้จะถูกใช้โดยไลบรารี Faker PHP เมื่อสร้างข้อมูลจำลองสำหรับ database seeds
    | ตัวอย่างเช่น จะใช้เพื่อรับหมายเลขโทรศัพท์ท้องถิ่น ข้อมูลที่อยู่ถนน เป็นต้น
    |
    */

    'faker_locale' => env('FAKER_LOCALE', 'en_US'),

    /*
    |--------------------------------------------------------------------------
    | คีย์การเข้ารหัส
    |--------------------------------------------------------------------------
    |
    | คีย์นี้ถูกใช้โดยบริการเข้ารหัสลับ Illuminate และควรตั้งค่าเป็นสตริงสุ่ม
    | ขนาด 32 ตัวอักษร มิฉะนั้นสตริงที่เข้ารหัสเหล่านี้จะไม่ปลอดภัย
    | โปรดทำสิ่งนี้ก่อนที่จะเผยแพร่แอปพลิเคชัน!
    |
    */

    'key' => env('APP_KEY'),

    'cipher' => 'AES-256-CBC',

    /*
    |--------------------------------------------------------------------------
    | ไดรเวอร์โหมดบำรุงรักษา
    |--------------------------------------------------------------------------
    |
    | ตัวเลือกการกำหนดค่าเหล่านี้กำหนดไดรเวอร์ที่ใช้ในการกำหนดและจัดการสถานะ
    | "โหมดบำรุงรักษา" ของ Laravel ไดรเวอร์ "cache" จะอนุญาตให้ควบคุมโหมด
    | บำรุงรักษาข้ามหลายเครื่อง
    |
    | ไดรเวอร์ที่รองรับ: "file", "cache"
    |
    */

    'maintenance' => [
        'driver' => 'file',
        // 'store'  => 'redis',
    ],

    /*
    |--------------------------------------------------------------------------
    | Service Providers ที่โหลดอัตโนมัติ
    |--------------------------------------------------------------------------
    |
    | Service providers ที่อยู่ในรายการนี้จะถูกโหลดโดยอัตโนมัติในการร้องขอ
    | ไปยังแอปพลิเคชันของคุณ คุณสามารถเพิ่มบริการของคุณเองในอาร์เรย์นี้
    | เพื่อให้ฟังก์ชันการทำงานที่ขยายแก่แอปพลิเคชันของคุณ
    |
    */

    'providers' => ServiceProvider::defaultProviders()->merge([
        /*
         * Package Service Providers...
         */

        /*
         * Application Service Providers...
         */
        App\Providers\AppServiceProvider::class,
        App\Providers\AuthServiceProvider::class,
        // App\Providers\BroadcastServiceProvider::class,
        App\Providers\EventServiceProvider::class,
        App\Providers\RouteServiceProvider::class,

        /*
        * Third Party Service Providers...
        */
        Gloudemans\Shoppingcart\ShoppingcartServiceProvider::class
    ])->toArray(),

    /*
    |--------------------------------------------------------------------------
    | นามแฝงของคลาส
    |--------------------------------------------------------------------------
    |
    | อาร์เรย์ของนามแฝงคลาสนี้จะถูกลงทะเบียนเมื่อแอปพลิเคชันนี้เริ่มต้น
    | อย่างไรก็ตาม คุณสามารถลงทะเบียนได้มากเท่าที่คุณต้องการเนื่องจาก
    | นามแฝงถูก "โหลดแบบขี้เกียจ" ดังนั้นจึงไม่ส่งผลต่อประสิทธิภาพ
    |
    */

    'aliases' => Facade::defaultAliases()->merge([
        // 'Example' => App\Facades\Example::class,
    ])->toArray(),

];
